Ran Plan for project: `example` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_virtual_network.example has been changed
~ resource "azurerm_virtual_network" "example" {
        id                      = "/subscriptions/5cca8fc3-8eb9-4480-9af6-1ee8adde1b01/resourceGroups/example-resources/providers/Microsoft.Network/virtualNetworks/example-vnet"
        name                    = "example-vnet"
      + tags                    = {}
        # (7 unchanged attributes hidden)
    }
  # azurerm_resource_group.example has been changed
~ resource "azurerm_resource_group" "example" {
        id       = "/subscriptions/5cca8fc3-8eb9-4480-9af6-1ee8adde1b01/resourceGroups/example-resources"
        name     = "example-resources"
      + tags     = {}
        # (1 unchanged attribute hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_virtual_network.example must be replaced
-/+ resource "azurerm_virtual_network" "example" {
      ~ dns_servers             = [] -> (known after apply)
      - flow_timeout_in_minutes = 0 -> null
      ~ guid                    = "2d425395-fd23-4254-81f5-0d69b29a1eee" -> (known after apply)
      ~ id                      = "/subscriptions/5cca8fc3-8eb9-4480-9af6-1ee8adde1b01/resourceGroups/example-resources/providers/Microsoft.Network/virtualNetworks/example-vnet" -> (known after apply)
      ~ name                    = "example-vnet" -> "test-atlantis" # forces replacement
      ~ subnet                  = [] -> (known after apply)
      - tags                    = {} -> null
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
~ virtual_network_name = "example-vnet" -> "test-atlantis"

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p example`
* :put_litter_in_its_place: To **delete** this plan click [here](http://8f379168bd10:4141/lock?id=nitinprajapati01%252Fatlantis-demo%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p example`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
